Revit 2026 API

# SweptBlendBottomSketch Property

---

The bottom profile sketch of the swept blend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch BottomSketch { get; }
```
```vb
Public ReadOnly Property BottomSketch As Sketch
	Get
```
```cpp
public:
property Sketch^ BottomSketch {
	Sketch^ get ();
}
```
```fsharp
member BottomSketch : Sketch with get
```

#### Property Value

Sketch

If the bottom profile is based on a family symbol, this property is .

#### Reference

SweptBlend Class

Autodesk.Revit.DB Namespace